# Це не ще одне завдання, а навчальний приклад
# з використанням імпорту модулів.
# Модуль являє собою пітонівський файл,
# у якому описуються функції. На відміну від головної програми,
# модуль не запускається, а імпортується — тобто, інша програма
# завантажує цей файл і бере з нього потрібні функції.
# Наприклад, з описаного раніше модуля task2_correct ми беремо функцію input_int:
from task2_correct import input_int
# (task2_correct.py має лежати в тій же папці, що й ця програма)

# Також багато модулів входять до стандартної бібліотеки пітона,
# і з них теж можна імпортувати функції:
from random import randint # функція randint генерує випадкове ціле число

print('''
Зіграємо в гру:
я загадаю якесь ціле число, а ти вгадуватимеш, доки не вгадаєш.
''')
secret=randint(1, 100500) # загадуємо випадкове число від 1 до 100500
n=-1 # створюємо змінну n (яка початково має відрізнятися від загаданого числа)
while n != secret: # != — «не дорівнює»; цикл триває, поки користувач не вгадає число
    n=input_int('Введи ціле число') # викликаємо функцію, яку ми описали в іншому модулі
    if n==None: # якщо користувач ввів порожній рядок
        if input('Зупинимо гру? (y/n)')=='y': # перепитуємо, чи справді він хоче вийти
            exit() # якщо він сказав y — виходимо
    elif secret>n: # elif — інакше якщо виконується умова
        print('Ні, більше!')
    elif secret<n:
        print('Ні, менше!')
print('Вгадав! Так, це', secret)